# Taps
tap "FelixKratz/formulae"    # borders
tap "nikitabobko/tap"

# CLI tools
brew "git"        # バージョン管理
brew "neovim"     # テキストエディタ (AstroNvim)
brew "sheldon"    # zsh プラグインマネージャ
brew "starship"   # クロスシェルプロンプト
brew "fzf"        # ファジーファインダー
# brew "sketchybar" # macOS ステータスバー (Ice に移行、設定は .config/sketchybar/ に保持)
brew "lua"        # Neovim スクリプト
brew "ripgrep"    # 高速 grep (rg)
brew "bat"        # cat 上位互換 (シンタックスハイライト)
brew "eza"        # ls 上位互換 (アイコン/Git 表示)
brew "zoxide"     # cd 上位互換 (学習型ディレクトリジャンプ)
brew "atuin"      # history 上位互換 (DB 管理/同期)
brew "git-delta"  # git diff 上位互換 (シンタックスハイライト)
brew "dust"       # du 上位互換 (ツリー表示)
brew "yazi"       # ターミナルファイルマネージャー
brew "fd"         # 高速 find
brew "tree-sitter-cli" # Tree-sitter パーサ CLI (Neovim)
brew "grep"       # GNU grep (macOS 標準より高機能)
brew "gh"         # GitHub CLI
brew "mise"       # ランタイムバージョンマネージャ (asdf 互換)
brew "uv"         # Python パッケージマネージャ (uvx で code-review-graph 等を実行)
brew "borders"    # ウィンドウ枠線ハイライト
brew "nb"         # ターミナルノート管理 CLI
brew "direnv"     # ディレクトリ別環境変数マネージャ

# GUI apps
cask "wezterm"            # GPU アクセラレーテッドターミナル
cask "ghostty"            # GPU アクセラレーテッドターミナル (代替)
cask "aerospace"          # タイル型ウィンドウマネージャ
cask "karabiner-elements" # キーボードカスタマイズ
cask "sf-symbols"         # Apple SF Symbols ブラウザ
cask "macskk"             # SKK 日本語入力メソッド
cask "jordanbaird-ice"    # メニューバーマネージャ (SketchyBar 後継)
cask "raycast"            # ランチャー (Spotlight 代替)

# Fonts
cask "font-hackgen-nerd"  # HackGen Nerd Font (日本語対応)
cask "font-hack-nerd-font" # Hack Nerd Font
