# CLI tools
brew "git"        # バージョン管理
brew "neovim"     # テキストエディタ (AstroNvim)
brew "sheldon"    # zsh プラグインマネージャ
brew "starship"   # クロスシェルプロンプト
brew "fzf"        # ファジーファインダー
brew "sketchybar" # macOS ステータスバー
brew "lua"        # Sketchybar/Neovim スクリプト
brew "grep"       # GNU grep (macOS 標準より高機能)
brew "gh"         # GitHub CLI
brew "mise"       # ランタイムバージョンマネージャ (asdf 互換)
brew "borders"    # ウィンドウ枠線ハイライト

# GUI apps
cask "wezterm"            # GPU アクセラレーテッドターミナル
cask "ghostty"            # GPU アクセラレーテッドターミナル (代替)
cask "aerospace"          # タイル型ウィンドウマネージャ
cask "karabiner-elements" # キーボードカスタマイズ
cask "sf-symbols"         # Apple SF Symbols ブラウザ

# Fonts
cask "font-hackgen-nerd"  # HackGen Nerd Font (日本語対応)
cask "font-hack-nerd-font" # Hack Nerd Font
